## Techcrush 3 Task

Find the zip file for the task named “Pizza+Place+Sales.zip” in the Datasets folder on the drive. It contains four CSV files: Orders, Order Details, Pizzas, and Pizza Types. You’ll also find a data dictionary that describes each dataset
Tip: You can join the four CSV files into a single data frame before you start your analysis. Pizza Place Sales A year's worth of sales from a fictitious pizza place, including the date and time of each order and the pizzas served, with additional details on the type, size, quantity, price, and ingredients.

#### Recommended Analysis
1. What is the total revenue/sales?
2. Find the total quantity sold.
3. Find the total orders.
4. How many pizza types do they sell?
5. Find the average price of the pizzas.
6. What are the peak hours of sales?
7. Find the total sales made on each day of the week. Which day of the week is when sales are made the most?
8. Find the top 5 bestselling pizzas.
9. Find the sales made in each month. Any trend noticeable?
10. re there pizza types that are not doing well on the menu?

Don’t limit yourself to these questions; explore the data as deep as you can.

In [58]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

In [59]:
#inporting the four csv files

order_details = pd.read_csv(r"C:\Users\THETRALBOOSS00\Downloads\DATASETS-20260211T121538Z-1-001\DATASETS\Pizza+Place+Sales\pizza_sales\order_details.csv")
orders = pd.read_csv(r"C:\Users\THETRALBOOSS00\Downloads\DATASETS-20260211T121538Z-1-001\DATASETS\Pizza+Place+Sales\pizza_sales\orders.csv")
pizza = pd.read_csv(r"C:\Users\THETRALBOOSS00\Downloads\DATASETS-20260211T121538Z-1-001\DATASETS\Pizza+Place+Sales\pizza_sales\pizzas.csv")
pizza_type = pd.read_csv(
    r"C:\Users\THETRALBOOSS00\Downloads\DATASETS-20260211T121538Z-1-001\DATASETS\Pizza+Place+Sales\pizza_sales\pizza_types.csv", 
    encoding='latin1') # Use 'latin1' encoding because the CSV was likely exported from Microsoft Excel

In [61]:
order_details.head()

   order_details_id  order_id       pizza_id  quantity
0                 1         1     hawaiian_m         1
1                 2         2  classic_dlx_m         1
2                 3         2  five_cheese_l         1
3                 4         2    ital_supr_l         1
4                 5         2     mexicana_m         1

In [5]:
order_details.columns

Index(['order_details_id', 'order_id', 'pizza_id', 'quantity'], dtype='object')

In [62]:
order_details.info() #checlking the information on the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48620 entries, 0 to 48619
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_details_id  48620 non-null  int64
 1   order_id          48620 non-null  int64
 2   pizza_id          48620 non-null  object
 3   quantity          48620 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [63]:
orders.head()

   order_id        date      time
0         1  2015-01-01  11:38:36
1         2  2015-01-01  11:57:40
2         3  2015-01-01  12:12:28
3         4  2015-01-01  12:16:31
4         5  2015-01-01  12:21:30

In [7]:
orders.columns #checking for the column

Index(['order_id', 'date', 'time'], dtype='object')

In [64]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21350 entries, 0 to 21349
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   order_id  21350 non-null  int64
 1   date      21350 non-null  object
 2   time      21350 non-null  object
dtypes: int64(1), object(2)
memory usage: 500.5+ KB

In [65]:
pizza.head()

     pizza_id pizza_type_id size  price
0   bbq_ckn_s       bbq_ckn    S  12.75
1   bbq_ckn_m       bbq_ckn    M  16.75
2   bbq_ckn_l       bbq_ckn    L  20.75
3  cali_ckn_s      cali_ckn    S  12.75
4  cali_ckn_m      cali_ckn    M  16.75

In [66]:
pizza.info() #checking the data information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96 entries, 0 to 95
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   pizza_id       96 non-null     object
 1   pizza_type_id  96 non-null     object
 2   size           96 non-null     object
 3   price          96 non-null     float64
dtypes: float64(1), object(3)
memory usage: 3.1+ KB

In [67]:
pizza_type.head()

,pizza_type_id,name,category,ingredients
0,bbq_ckn,The Barbecue Chicken Pizza,Chicken,"Barbecued Chicken, Red Peppers, Green Peppers,..."
1,cali_ckn,The California Chicken Pizza,Chicken,"Chicken, Artichoke, Spinach, Garlic, Jalapeno ..."
2,ckn_alfredo,The Chicken Alfredo Pizza,Chicken,"Chicken, Red Onions, Red Peppers, Mushrooms, A..."
3,ckn_pesto,The Chicken Pesto Pizza,Chicken,"Chicken, Tomatoes, Red Peppers, Spinach, Garli..."
4,southw_ckn,The Southwest Chicken Pizza,Chicken,"Chicken, Tomatoes, Red Peppers, Red Onions, Ja..."

In [68]:
pizza_type.info() #Checking the data information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   pizza_type_id  32 non-null     object
 1   name           32 non-null     object
 2   category       32 non-null     object
 3   ingredients    32 non-null     object
dtypes: object(4)
memory usage: 1.1+ KB

In [10]:
pizza.columns

Index(['pizza_id', 'pizza_type_id', 'size', 'price'], dtype='object')

## After carefully observing the datas 
- i come in concluson that both orders_detail_id and order has id in common
- pizza and pizza_type has pizza_type id in common 

- with this info i am merging them with the mos common collomn for both dsta before merging them, all together
- Data can be merge by either outer or inner join but i chose to use outer join to remove the irregularities myself

In [11]:
all_data = pd.merge(order_details, orders, on='order_id', how='outer') #merging the whole daata together
all_data = pd.merge(all_data, pizza, on='pizza_id', how='outer')

all_data

,order_details_id,order_id,pizza_id,quantity,date,time,pizza_type_id,size,price
0,26.0,11.0,bbq_ckn_l,1.0,2015-01-01,13:02:59,bbq_ckn,L,20.75
1,43.0,17.0,bbq_ckn_l,1.0,2015-01-01,13:53:00,bbq_ckn,L,20.75
2,71.0,27.0,bbq_ckn_l,1.0,2015-01-01,15:11:17,bbq_ckn,L,20.75
3,83.0,33.0,bbq_ckn_l,1.0,2015-01-01,15:54:08,bbq_ckn,L,20.75
4,123.0,51.0,bbq_ckn_l,1.0,2015-01-01,18:48:28,bbq_ckn,L,20.75
...,...,...,...,...,...,...,...,...,...
48620,48406.0,21251.0,veggie_veg_s,2.0,2015-12-30,12:45:20,veggie_veg,S,12.00
48621,48493.0,21296.0,veggie_veg_s,1.0,2015-12-31,15:13:40,veggie_veg,S,12.00
48622,48500.0,21298.0,veggie_veg_s,1.0,2015-12-31,15:35:37,veggie_veg,S,12.00
48623,48503.0,21299.0,veggie_veg_s,1.0,2015-12-31,15:52:16,veggie_veg,S,12.00
48624,48553.0,21319.0,veggie_veg_s,1.0,2015-12-31,18:07:19,veggie_veg,S,12.00

In [12]:
all_data.info() #checking for all the data information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48625 entries, 0 to 48624
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_details_id  48620 non-null  float64
 1   order_id          48620 non-null  float64
 2   pizza_id          48625 non-null  object
 3   quantity          48620 non-null  float64
 4   date              48620 non-null  object
 5   time              48620 non-null  object
 6   pizza_type_id     48625 non-null  object
 7   size              48625 non-null  object
 8   price             48625 non-null  float64
dtypes: float64(4), object(5)
memory usage: 3.3+ MB

In [13]:
all_data.columns #checking for all the data cloumn

Index(['order_details_id', 'order_id', 'pizza_id', 'quantity', 'date', 'time',
       'pizza_type_id', 'size', 'price'],
      dtype='object')

In [69]:
all_data.isna().sum() #checking for the NAN in the data

order_details_id    0
order_id            0
pizza_id            0
quantity            0
date                0
time                0
pizza_type_id       0
size                0
price               0
datetime            0
total_price         0
month               0
dtype: int64

In [15]:
# Show only the rows where there is NAN
missing_pizzas = all_data[all_data['order_id'].isna()]
missing_pizzas[['order_details_id', 'pizza_id']]

       order_details_id       pizza_id
2372                NaN     big_meat_l
2373                NaN     big_meat_m
13610               NaN  five_cheese_m
13611               NaN  five_cheese_s
15462               NaN  four_cheese_s

In [16]:
all_data = all_data.dropna(subset=['order_id',])

In [17]:
all_data.isna().sum() #checking if the NAN has been dropped

order_details_id    0
order_id            0
pizza_id            0
quantity            0
date                0
time                0
pizza_type_id       0
size                0
price               0
dtype: int64

In [18]:
all_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 48620 entries, 0 to 48624
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_details_id  48620 non-null  float64
 1   order_id          48620 non-null  float64
 2   pizza_id          48620 non-null  object
 3   quantity          48620 non-null  float64
 4   date              48620 non-null  object
 5   time              48620 non-null  object
 6   pizza_type_id     48620 non-null  object
 7   size              48620 non-null  object
 8   price             48620 non-null  float64
dtypes: float64(4), object(5)
memory usage: 3.7+ MB

In [32]:
all_data["datetime"] = pd.to_datetime(
    all_data["date"].astype(str) + " " + all_data["time"].astype(str)
) #joing the date and time together and also changing it t datetime type

In [20]:
all_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 48620 entries, 0 to 48624
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_details_id  48620 non-null  float64
 1   order_id          48620 non-null  float64
 2   pizza_id          48620 non-null  object
 3   quantity          48620 non-null  float64
 4   date              48620 non-null  object
 5   time              48620 non-null  object
 6   pizza_type_id     48620 non-null  object
 7   size              48620 non-null  object
 8   price             48620 non-null  float64
 9   datetime          48620 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(4), object(5)
memory usage: 4.1+ MB

## Question 1
- What is the total revenue/sales?

In [44]:
#calculating the total revenue/sales?

all_data['total_price'] = all_data['quantity'] * all_data['price']

# Sum that new column to get the grand total
total_revenue = all_data['total_price'].sum()
print(f"Total Revenue:${total_revenue:,.2f}")

Total Revenue:$817,860.05

## Question 2
- Find the total quantity sold.

In [45]:
# Finding the total quantity sold

# Sum all values in the 'quantity' column
total_quantity_sold = all_data['quantity'].sum()

print(f"Total Quantity Sold: {total_quantity_sold:,}")

Total Quantity Sold: 49,574.0

## Question 3
- Find the total orders

In [70]:
# Find the total orders.

all_data['order_id'].nunique() #nunique count how many unique (distinct) values exist in a column, ignoring any duplicates.

21350

## Question 4
- How many pizza types do they sell?

In [71]:
# How many pizza types do they sell?

total_pizza_type = pizza_type['pizza_type_id'].nunique()

total_pizza_type

32

## Question 5
- Find the average price of the pizzas.

In [72]:
# Find the average price of the pizzas.

all_data['price'].mean().round(2) #rounding the decimal to 2 places

np.float64(16.49)

## Question 6
- What are the peak hours of sales?

In [73]:
# What are the peak hours of sales?

all_data['datetime'].dt.hour.value_counts()

datetime
12    6543
13    6203
18    5359
17    5143
19    4350
16    4185
14    3521
20    3487
15    3170
11    2672
21    2528
22    1370
23      68
10      17
9        4
Name: count, dtype: int64

In [74]:
revenue_by_hour = all_data.groupby(all_data['datetime'].dt.hour)['total_price'].sum().sort_values(ascending=False)
revenue_by_hour

datetime
12    111877.90
13    106065.70
18     89296.85
17     86237.45
19     72628.90
16     70055.40
14     59201.40
20     58215.40
15     52992.30
11     44935.80
21     42029.80
22     22815.15
23      1121.35
10       303.65
9         83.00
Name: total_price, dtype: float64

## Question 7
- Find the total sales made on each day of the week. Which day of the week is when sales are made the most?

In [75]:
# Group by the name of the day and sum the revenue
sales_by_day = all_data.groupby(all_data['datetime'].dt.day_name())['total_price'].sum() 

#Sort the days in a logical order (Monday to Sunday)
days_order = ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'] 
sales_by_day = sales_by_day.reindex(days_order)

#Find which day has the highest value
peak_day = sales_by_day.idxmax() 

sales_by_day

datetime
Monday       107329.55
Tuesday      114133.80
Wednesday    114408.40
Thursday     123528.50
Friday       136073.90
Saturday     123182.40
Sunday        99203.50
Name: total_price, dtype: float64

In [76]:
peak_day

'Friday'

## Question 8
- Find the top 5 bestselling pizzas.

In [77]:
# Top 5 bestselling pizzas

all_data.groupby('pizza_type_id')['quantity'].sum().nlargest()

pizza_type_id
classic_dlx    2453.0
bbq_ckn        2432.0
hawaiian       2422.0
pepperoni      2418.0
thai_ckn       2371.0
Name: quantity, dtype: float64

## uestion 9
- Find the sales made in each month. Any trend noticeable?

In [78]:
# Extract the month name from the datetime column
all_data['month'] = all_data['datetime'].dt.month_name()

# Creating a list to sort the months
month_order = ['January', 'February', 'March', 'April', 'May', 'June', 
               'July', 'August', 'September', 'October', 'November', 'December']

# Group by month, sum revenue, and sort
monthly_sales = all_data.groupby('month')['total_price'].sum().reindex(month_order)

monthly_sales

month
January      69793.30
February     65159.60
March        70397.10
April        68736.80
May          71402.75
June         68230.20
July         72557.90
August       68278.25
September    64180.05
October      64027.60
November     70395.35
December     64701.15
Name: total_price, dtype: float64

## Question 10
- Are there pizza types that are not doing well on the menu?

In [79]:
# Find pizza types not doing well
poor_revenue = all_data.groupby('pizza_type_id')['total_price'].sum().nsmallest()

poor_revenue

pizza_type_id
brie_carre      11588.50
green_garden    13955.75
spinach_supr    15277.75
mediterraneo    15360.50
spin_pesto      15596.00
Name: total_price, dtype: float64